In [64]:
import pandas as pd

# create a sample DataFrame
data = {'A': ['apple', 'banana', 'pickle', 'tomato','tomato'],
        'B': ['fruit', 'fruit', 'veggie', 'fruit','veggie']}
df1 = pd.DataFrame(data)

In [84]:
df1

        A       B
0   apple   fruit
1  banana   fruit
2  pickle  veggie
3  tomato   fruit
4  tomato  veggie

In [85]:
df2 = df1.groupby('A').size().reset_index(name='sum')
df2['sum'] = df2['sum'] - 1

In [86]:
df3 = pd.merge(df1, df2, on='A').groupby('B')['sum'].sum().reset_index()

In [87]:
df3

        B  sum
0   fruit    1
1  veggie    1